foo <- c('Доходы, трлн руб.','в % к ВВП', 'Нефтегазовые, трлн руб.',
         'в % ко всем доходам', 'Расходы, трлн руб.', 'в % к ВВП',
         'Дефици(-), Профицит(+), трлн руб.', 'в % к ВВП')
year1 <- c(14.07, 19.9, 7.5, 51.9, 13.96, 19.5, +0.11, +0.2)
year2 <- c(15.08, 19.5, 7.7, 51.2, 15.51, 20.0, -0.43, -0.6)
year3 <- c(15.8, 19.0, 7.8, 50.8, 16.3, 19.6, -0.5, -0.6)
year4 <- c(16.5, 18.4, 8.34, 49.6, 17.0, 19.0, -0.5, -0.6)

Table <- data.frame(Показатели = foo, '2014' = year1, '2015' = year2, '2015' = year3,
                              '2016' = year4)
print(Table)
