a <- c(7:4,0)
b <- c(8,10.5,0,-2,9)

# РЎР»РѕР¶РµРЅРёРµ РІРµРєС‚РѕСЂРѕРІ
c <- a+b; print(c)

# РЈРјРЅРѕР¶РµРЅРёРµ РІРµРєС‚РѕСЂРѕРІ
d <- a*b; print(d)

# Р”РµР»РµРЅРёРµ РІРµРєС‚РѕСЂРѕРІ
e <- a/b; print(e)

# РЎСЂРµРґРЅРµРµ Р°СЂРёС„РјРµС‚РёС‡РµСЃРєРѕРµ
m <- mean(a); print(paste('РЎСЂРµРґРЅРµРµ Р°СЂРёС„РјРµС‚РёС‡РµСЃРєРѕРµ РІРµРєС‚РѕСЂР° a =',m))
m1 <- mean(b); print(paste('РЎСЂРµРґРЅРµРµ Р°СЂРёС„РјРµС‚РёС‡РµСЃРєРѕРµ РІРµРєС‚РѕСЂР° b =',m1))

# РЎСѓРјРјР° СЌР»РµРјРµРЅС‚РѕРІ РІРµРєС‚РѕСЂР°
s <- sum(a); print(paste('РЎСѓРјРјР° СЌР»РµРјРµРЅС‚РѕРІ РІРµРєС‚РѕСЂР° a =',s))
s1 <- sum(b); print(paste('РЎСѓРјРјР° СЌР»РµРјРµРЅС‚РѕРІ РІРµРєС‚РѕСЂР° b =',s1))