Задание 3


a <- 123

b <- -123


a + b

a * b

a*(a + b)

a %% 10

b^2

((a-b)*(a%%10))^(-1) / 2

pi * 2

pi/pi/2*3

sqrt(b^2)

(b + a * 2) %/% 10



Задание 4



# Неявное преобразование типов - character преобразуется в double


a <- -28

b <- '20 + 10'

c <- a<b

c

typeof(a)

typeof(b)

typeof(c)



# character преобразуется в integer


a <- -28L

b <- '-28'

a == b



# double преобразуется в logical



a <- 2

b <- TRUE

typeof(a)

a == b



Задание 5


# Скалярные значения



q1 <- -123

q2 <- 15



q3 <- (q1 == -123)&(q2 == 15)

q3

q3 <- (q1 == -123)&(q2 == 5)

q3

q3 <- (q1 == -123)&(q2 == 15)

q3

q3 <- (q1 == -123)&&(q2 == 5)

q3




# Векторы


q1 <- (1:3)

q2 <- (0:4)


q3 <- (q1 == 1)&(q2 == 3)

q3

q3 <- (q1 == 0)&(q2 == 2)

q3

q3 <- (q1 == 1)&&(q2 == 2)

q3

q3 <- (q1 == 0)&&(q2 == 4)

q3



Задание 6


3/7

3/7 – 1.571429



Задание 7


sqrt(2)*sqrt(2)

(sqrt(2)*sqrt(2))-2